---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderLegsAngleTooGreatOrRunWidthTooSmallFailure
source: html/108f4852-d194-7677-d187-0c94f506d341.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderLegsAngleTooGreatOrRunWidthTooSmallFailure Property

The angle between two consecutive legs are too great or the runwidth is too small.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderLegsAngleTooGreatOrRunWidthTooSmallFailure { get; }
```